package strman

//Hm is an Ascii map
var Hm = make(map[string][]string)

//LoadMapArrays .....
func LoadMapArrays() {
	Hm["0"] = []string{"°", "₀", "۰"}
	Hm["1"] = []string{"¹", "₁", "۱"}
	Hm["2"] = []string{"²", "₂", "۲"}
	Hm["3"] = []string{"³", "₃", "۳"}
	Hm["4"] = []string{"⁴", "₄", "۴", "٤"}
	Hm["5"] = []string{"⁵", "₅", "۵", "٥"}
	Hm["6"] = []string{"⁶", "₆", "۶", "٦"}
	Hm["7"] = []string{"⁷", "₇", "۷"}
	Hm["8"] = []string{"⁸", "₈", "۸"}
	Hm["9"] = []string{"⁹", "₉", "۹"}
	Hm["a"] = []string{"à", "á", "ả", "ã", "ạ", "ă", "ắ", "ằ", "ẳ", "ẵ", "ặ", "â", "ấ", "ầ", "ẩ", "ẫ", "ậ",
		"ā", "ą", "å", "α", "ά", "ἀ", "ἁ", "ἂ", "ἃ", "ἄ", "ἅ", "ἆ", "ἇ", "ᾀ", "ᾁ", "ᾂ", "ᾃ",
		"ᾄ", "ᾅ", "ᾆ", "ᾇ", "ὰ", "ά", "ᾰ", "ᾱ", "ᾲ", "ᾳ", "ᾴ", "ᾶ", "ᾷ", "а", "أ", "အ", "ာ",
		"ါ", "ǻ", "ǎ", "ª", "ა", "अ", "ا"}
	Hm["b"] = []string{"б", "β", "Ъ", "Ь", "ب", "ဗ", "ბ"}
	Hm["c"] = []string{"ç", "ć", "č", "ĉ", "ċ"}
	Hm["d"] = []string{"ď", "ð", "đ", "ƌ", "ȡ", "ɖ", "ɗ", "ᵭ", "ᶁ", "ᶑ", "д", "δ", "د", "ض", "ဍ", "ဒ", "დ"}
	Hm["e"] = []string{"é", "è", "ẻ", "ẽ", "ẹ", "ê", "ế", "ề", "ể", "ễ", "ệ", "ë", "ē", "ę", "ě", "ĕ", "ė",
		"ε", "έ", "ἐ", "ἑ", "ἒ", "ἓ", "ἔ", "ἕ", "ὲ", "έ", "е", "ё", "э", "є", "ə", "ဧ", "ေ",
		"ဲ", "ე", "ए", "إ", "ئ"}
	Hm["f"] = []string{"ф", "φ", "ف", "ƒ", "ფ"}
	Hm["g"] = []string{"ĝ", "ğ", "ġ", "ģ", "г", "ґ", "γ", "ဂ", "გ", "گ"}
	Hm["h"] = []string{"ĥ", "ħ", "η", "ή", "ح", "ه", "ဟ", "ှ", "ჰ"}
	Hm["i"] = []string{"í", "ì", "ỉ", "ĩ", "ị", "î", "ï", "ī", "ĭ", "į", "ı", "ι", "ί", "ϊ", "ΐ", "ἰ", "ἱ",
		"ἲ", "ἳ", "ἴ", "ἵ", "ἶ", "ἷ", "ὶ", "ί", "ῐ", "ῑ", "ῒ", "ΐ", "ῖ", "ῗ", "і", "ї", "и",
		"ဣ", "ိ", "ီ", "ည်", "ǐ", "ი", "इ", "ی"}
	Hm["j"] = []string{"ĵ", "ј", "Ј", "ჯ", "ج"}
	Hm["k"] = []string{"ķ", "ĸ", "к", "κ", "Ķ", "ق", "ك", "က", "კ", "ქ", "ک"}
	Hm["l"] = []string{"ł", "ľ", "ĺ", "ļ", "ŀ", "л", "λ", "ل", "လ", "ლ"}
	Hm["m"] = []string{"м", "μ", "م", "မ", "მ"}
	Hm["n"] = []string{"ñ", "ń", "ň", "ņ", "ŉ", "ŋ", "ν", "н", "ن", "န", "ნ"}
	Hm["o"] = []string{"ó", "ò", "ỏ", "õ", "ọ", "ô", "ố", "ồ", "ổ", "ỗ", "ộ", "ơ", "ớ", "ờ", "ở", "ỡ", "ợ",
		"ø", "ō", "ő", "ŏ", "ο", "ὀ", "ὁ", "ὂ", "ὃ", "ὄ", "ὅ", "ὸ", "ό", "о", "و", "θ", "ို",
		"ǒ", "ǿ", "º", "ო", "ओ"}
	Hm["p"] = []string{"п", "π", "ပ", "პ", "پ"}
	Hm["q"] = []string{"ყ"}
	Hm["r"] = []string{"ŕ", "ř", "ŗ", "р", "ρ", "ر", "რ"}
	Hm["s"] = []string{"ś", "š", "ş", "с", "σ", "ș", "ς", "س", "ص", "စ", "ſ", "ს"}
	Hm["t"] = []string{"ť", "ţ", "т", "τ", "ț", "ت", "ط", "ဋ", "တ", "ŧ", "თ", "ტ"}
	Hm["u"] = []string{"ú", "ù", "ủ", "ũ", "ụ", "ư", "ứ", "ừ", "ử", "ữ", "ự", "û", "ū", "ů", "ű", "ŭ", "ų",
		"µ", "у", "ဉ", "ု", "ူ", "ǔ", "ǖ", "ǘ", "ǚ", "ǜ", "უ", "उ"}
	Hm["v"] = []string{"в", "ვ", "ϐ"}
	Hm["w"] = []string{"ŵ", "ω", "ώ", "ဝ", "ွ"}
	Hm["x"] = []string{"χ", "ξ"}
	Hm["y"] = []string{"ý", "ỳ", "ỷ", "ỹ", "ỵ", "ÿ", "ŷ", "й", "ы", "υ", "ϋ", "ύ", "ΰ", "ي", "ယ"}
	Hm["z"] = []string{"ź", "ž", "ż", "з", "ζ", "ز", "ဇ", "ზ"}
	Hm["aa"] = []string{"ع", "आ", "آ"}
	Hm["ae"] = []string{"ä", "æ", "ǽ"}
	Hm["ai"] = []string{"ऐ"}
	Hm["at"] = []string{"@"}
	Hm["ch"] = []string{"ч", "ჩ", "ჭ", "چ"}
	Hm["dj"] = []string{"ђ", "đ"}
	Hm["dz"] = []string{"џ", "ძ"}
	Hm["ei"] = []string{"ऍ"}
	Hm["gh"] = []string{"غ", "ღ"}
	Hm["ii"] = []string{"ई"}
	Hm["ij"] = []string{"ĳ"}
	Hm["kh"] = []string{"х", "خ", "ხ"}
	Hm["lj"] = []string{"љ"}
	Hm["nj"] = []string{"њ"}
	Hm["oe"] = []string{"ö", "œ", "ؤ"}
	Hm["oi"] = []string{"ऑ"}
	Hm["oii"] = []string{"ऒ"}
	Hm["ps"] = []string{"ψ"}
	Hm["sh"] = []string{"ш", "შ", "ش"}
	Hm["shch"] = []string{"щ"}
	Hm["ss"] = []string{"ß"}
	Hm["sx"] = []string{"ŝ"}
	Hm["th"] = []string{"þ", "ϑ", "ث", "ذ", "ظ"}
	Hm["ts"] = []string{"ц", "ც", "წ"}
	Hm["ue"] = []string{"ü"}
	Hm["uu"] = []string{"ऊ"}
	Hm["ya"] = []string{"я"}
	Hm["yu"] = []string{"ю"}
	Hm["zh"] = []string{"ж", "ჟ", "ژ"}
	Hm["(c)"] = []string{"©"}
	Hm["A"] = []string{"Á", "À", "Ả", "Ã", "Ạ", "Ă", "Ắ", "Ằ", "Ẳ", "Ẵ", "Ặ", "Â", "Ấ", "Ầ", "Ẩ", "Ẫ", "Ậ", "Å",
		"Ā", "Ą", "Α", "Ά", "Ἀ", "Ἁ", "Ἂ", "Ἃ", "Ἄ", "Ἅ", "Ἆ", "Ἇ", "ᾈ", "ᾉ", "ᾊ", "ᾋ", "ᾌ", "ᾍ",
		"ᾎ", "ᾏ", "Ᾰ", "Ᾱ", "Ὰ", "Ά", "ᾼ", "А", "Ǻ", "Ǎ"}
	Hm["B"] = []string{"Б", "Β", "ब"}
	Hm["C"] = []string{"Ç", "Ć", "Č", "Ĉ", "Ċ"}
	Hm["D"] = []string{"Ď", "Ð", "Đ", "Ɖ", "Ɗ", "Ƌ", "ᴅ", "ᴆ", "Д", "Δ"}
	Hm["E"] = []string{"É", "È", "Ẻ", "Ẽ", "Ẹ", "Ê", "Ế", "Ề", "Ể", "Ễ", "Ệ", "Ë", "Ē", "Ę", "Ě", "Ĕ", "Ė", "Ε",
		"Έ", "Ἐ", "Ἑ", "Ἒ", "Ἓ", "Ἔ", "Ἕ", "Έ", "Ὲ", "Е", "Ё", "Э", "Є", "Ə"}
	Hm["F"] = []string{"Ф", "Φ"}
	Hm["G"] = []string{"Ğ", "Ġ", "Ģ", "Г", "Ґ", "Γ"}
	Hm["H"] = []string{"Η", "Ή", "Ħ"}
	Hm["I"] = []string{"Í", "Ì", "Ỉ", "Ĩ", "Ị", "Î", "Ï", "Ī", "Ĭ", "Į", "İ", "Ι", "Ί", "Ϊ", "Ἰ", "Ἱ", "Ἳ", "Ἴ",
		"Ἵ", "Ἶ", "Ἷ", "Ῐ", "Ῑ", "Ὶ", "Ί", "И", "І", "Ї", "Ǐ", "ϒ"}
	Hm["K"] = []string{"К", "Κ"}
	Hm["L"] = []string{"Ĺ", "Ł", "Л", "Λ", "Ļ", "Ľ", "Ŀ", "ल"}
	Hm["M"] = []string{"М", "Μ"}
	Hm["N"] = []string{"Ń", "Ñ", "Ň", "Ņ", "Ŋ", "Н", "Ν"}
	Hm["O"] = []string{"Ó", "Ò", "Ỏ", "Õ", "Ọ", "Ô", "Ố", "Ồ", "Ổ", "Ỗ", "Ộ", "Ơ", "Ớ", "Ờ", "Ở", "Ỡ", "Ợ", "Ø",
		"Ō", "Ő", "Ŏ", "Ο", "Ό", "Ὀ", "Ὁ", "Ὂ", "Ὃ", "Ὄ", "Ὅ", "Ὸ", "Ό", "О", "Θ", "Ө", "Ǒ", "Ǿ"}
	Hm["P"] = []string{"П", "Π"}
	Hm["R"] = []string{"Ř", "Ŕ", "Р", "Ρ", "Ŗ"}
	Hm["S"] = []string{"Ş", "Ŝ", "Ș", "Š", "Ś", "С", "Σ"}
	Hm["T"] = []string{"Ť", "Ţ", "Ŧ", "Ț", "Т", "Τ"}
	Hm["U"] = []string{"Ú", "Ù", "Ủ", "Ũ", "Ụ", "Ư", "Ứ", "Ừ", "Ử", "Ữ", "Ự", "Û", "Ū", "Ů", "Ű", "Ŭ", "Ų", "У",
		"Ǔ", "Ǖ", "Ǘ", "Ǚ", "Ǜ"}
	Hm["V"] = []string{"В"}
	Hm["W"] = []string{"Ω", "Ώ", "Ŵ"}
	Hm["X"] = []string{"Χ", "Ξ"}
	Hm["Y"] = []string{"Ý", "Ỳ", "Ỷ", "Ỹ", "Ỵ", "Ÿ", "Ῠ", "Ῡ", "Ὺ", "Ύ", "Ы", "Й", "Υ", "Ϋ", "Ŷ"}
	Hm["Z"] = []string{"Ź", "Ž", "Ż", "З", "Ζ"}
	Hm["AE"] = []string{"Ä", "Æ", "Ǽ"}
	Hm["CH"] = []string{"Ч"}
	Hm["DJ"] = []string{"Ђ"}
	Hm["DZ"] = []string{"Џ"}
	Hm["GX"] = []string{"Ĝ"}
	Hm["HX"] = []string{"Ĥ"}
	Hm["IJ"] = []string{"Ĳ"}
	Hm["JX"] = []string{"Ĵ"}
	Hm["KH"] = []string{"Х"}
	Hm["LJ"] = []string{"Љ"}
	Hm["NJ"] = []string{"Њ"}
	Hm["OE"] = []string{"Ö", "Œ"}
	Hm["PS"] = []string{"Ψ"}
	Hm["SH"] = []string{"Ш"}
	Hm["SHCH"] = []string{"Щ"}
	Hm["SS"] = []string{"ẞ"}
	Hm["TH"] = []string{"Þ"}
	Hm["TS"] = []string{"Ц"}
	Hm["UE"] = []string{"Ü"}
	Hm["YA"] = []string{"Я"}
	Hm["YU"] = []string{"Ю"}
	Hm["ZH"] = []string{"Ж"}
	Hm[" "] = []string{"\\xC2\\xA0", "\\xE2\\x80\\x80", "\\xE2\\x80\\x81", "\\xE2\\x80\\x82", "\\xE2\\x80\\x83",
		"\\xE2\\x80\\x84", "\\xE2\\x80\\x85", "\\xE2\\x80\\x86", "\\xE2\\x80\\x87", "\\xE2\\x80\\x88",
		"\\xE2\\x80\\x89", "\\xE2\\x80\\x8A", "\\xE2\\x80\\xAF", "\\xE2\\x81\\x9F", "\\xE3\\x80\\x80"}

}
